app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE (TRUE=FALSE)

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at", "body") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "aasdas"], ["created_at", "2023-02-12 00:51:55.146558"], ["updated_at", "2023-02-12 00:51:55.146558"], ["body", nil]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "Firstqwe"], ["updated_at", "2023-02-05 23:26:04.243816"], ["id", 1]]

  def destroy
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]

    def set_article
      @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]